In [1]:
# Series - same as arrays, but has 'axis labels'
    # Subsetting like Dictionary
    # QUERY method, https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#the-query-method
# DataFrame - bunch of series sharing the same index
    # similar to Series, INPLACE = False by default
    # subset columns - provide column names     .. works for both 1D, 2D
    # subset rows - LOC = name / ILOC = index   .. works for both 1D, 2D
# Missing Data
# Groupby
# Merging, Joining, Concatenating : pd.merge, .join
# Operations- unique, nunique, value_counts, apply(func), sort_values, pivot_table
# Data Input/ Output - CSV, Excel, HTML, SQL

In [1]:
import numpy as np
import pandas as pd

In [3]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20,'c':30}

In [4]:
pd.Series(data=my_data), pd.Series(data=my_data, index=labels)

(0    10
 1    20
 2    30
 dtype: int64,
 a    10
 b    20
 c    30
 dtype: int64)

In [5]:
pd.Series(arr), pd.Series(arr, labels)

(0    10
 1    20
 2    30
 dtype: int32,
 a    10
 b    20
 c    30
 dtype: int32)

In [6]:
pd.Series(d)         # Keys become index, Values remain values

a    10
b    20
c    30
dtype: int64

In [7]:
ser0 = pd.Series(labels)    # Can hold any object
ser0

0    a
1    b
2    c
dtype: object

In [8]:
ser0[1]

'b'

In [9]:
pd.Series(data=[sum, print, len]) # Can hold any object

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [10]:
ser1 = pd.Series([1,2,3,4],['US','UK','USSR','Germany'])
ser2 = pd.Series([1,2,5,4],['US','UK','Italy','Germany'])

In [11]:
ser1['US']

1

In [12]:
ser1>2

US         False
UK         False
USSR        True
Germany     True
dtype: bool

In [13]:
ser1 + ser2         # Adds by index, and Outer Join!

Germany    8.0
Italy      NaN
UK         4.0
US         2.0
USSR       NaN
dtype: float64

## DataFrame Intro

In [3]:
from numpy.random import randn

In [4]:
np.random.seed(101)
df = pd.DataFrame(randn(5,4), index=['A','B','C','D','E'], columns= ['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [5]:
df.query("W>0.5")

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [16]:
df['W'], type(df['W'])

(A    2.706850
 B    0.651118
 C   -2.018168
 D    0.188695
 E    0.190794
 Name: W, dtype: float64,
 pandas.core.series.Series)

In [17]:
df[['W','Z']]                               # subset columns

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [18]:
df['new'] = df['W']+df['Z']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [19]:
df.drop('new', axis=1, inplace=True)         # Default is NOT INPLACE.. better than axis is providing column name directly

In [20]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df.shape                                     # 0 is rows, 1 is columns

(5, 4)

In [22]:
df.loc['A'], df.loc[['A']]

(W    2.706850
 X    0.628133
 Y    0.907969
 Z    0.503826
 Name: A, dtype: float64,
          W         X         Y         Z
 A  2.70685  0.628133  0.907969  0.503826)

In [23]:
df.loc['C'], df.iloc[2]

(W   -2.018168
 X    0.740122
 Y    0.528813
 Z   -0.589001
 Name: C, dtype: float64,
 W   -2.018168
 X    0.740122
 Y    0.528813
 Z   -0.589001
 Name: C, dtype: float64)

In [24]:
df.loc['C','Z']

-0.5890005332865824

In [25]:
df.loc[['A','B'],['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [26]:
df.iloc[:2,2:]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [27]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [28]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
df['W'][df['W'] > 0]

A    2.706850
B    0.651118
D    0.188695
E    0.190794
Name: W, dtype: float64

In [31]:
df.loc[df['W'] > 0,'W']                 # This is cleaner syntax in my opinion

A    2.706850
B    0.651118
D    0.188695
E    0.190794
Name: W, dtype: float64

In [32]:
df[df['W'] > 0]['W']

A    2.706850
B    0.651118
D    0.188695
E    0.190794
Name: W, dtype: float64

In [33]:
df[(df['W']>0) & (df['Z']>0)]            # '&' instead of 'and' .. '|' instead of 'or'

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [36]:
new_index = 'CA NY WY OR CO'.split()

In [37]:
df['States'] = new_index
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [38]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## DataFrame advanced

In [39]:
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
print(hier_index)
hier_index = pd.MultiIndex.from_tuples(hier_index)
print(hier_index)

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]
MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [41]:
type(hier_index)

pandas.core.indexes.multi.MultiIndex

In [42]:
df = pd.DataFrame(randn(6,2), index=hier_index, columns=['A','B'])
df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [43]:
df.loc['G1']

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [44]:
df.loc['G1'].loc[1]

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [46]:
df.loc['G1'].loc[[1]]

          A        B
1 -0.497104 -0.75407

In [49]:
df.loc[('G1',1)]                 # Tuple works here

A   -0.497104
B   -0.754070
Name: (G1, 1), dtype: float64

In [50]:
df.index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [51]:
df.index.names

FrozenList([None, None])

In [52]:
df.index.names = ['OG','#']
df

             A         B
OG #
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [53]:
df.loc['G2'].loc[2]['A']

-0.993263499973366

In [54]:
df.xs(1, level='#')                          # Cross Section 'XS' subsetting with inner level

           A         B
OG
G1 -0.497104 -0.754070
G2  0.238127  1.996652

## Missing Data

In [55]:
d = {'A':[1,2, np.nan] ,'B': [5, np.nan, np.nan],'C':[1,2,3]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [56]:
df.fillna(value=99)

      A     B  C
0   1.0   5.0  1
1   2.0  99.0  2
2  99.0  99.0  3

In [57]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [58]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [59]:
df.dropna(axis=0, thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [60]:
df.dropna(axis=1, thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [65]:
np.mean(df), df.mean()

(A    1.5
 B    5.0
 C    2.0
 dtype: float64,
 A    1.5
 B    5.0
 C    2.0
 dtype: float64)

In [66]:
df.fillna(value=np.mean(df))    # FILL each columns with its own MEAN value

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [67]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [68]:
bycomp = df.groupby(by='Company')
bycomp

In [69]:
bycomp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [70]:
bycomp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [71]:
bycomp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [72]:
df.describe()

            Sales
count    6.000000
mean   229.500000
std    100.899455
min    120.000000
25%    143.000000
50%    221.500000
75%    315.750000
max    350.000000

In [73]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [74]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [75]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [76]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [77]:
[df1,df2,df3]

[    A   B   C   D
 0  A0  B0  C0  D0
 1  A1  B1  C1  D1
 2  A2  B2  C2  D2
 3  A3  B3  C3  D3,
     A   B   C   D
 4  A4  B4  C4  D4
 5  A5  B5  C5  D5
 6  A6  B6  C6  D6
 7  A7  B7  C7  D7,
       A    B    C    D
 8    A8   B8   C8   D8
 9    A9   B9   C9   D9
 10  A10  B10  C10  D10
 11  A11  B11  C11  D11]

In [78]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [79]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [80]:
df2.columns = ['W','X','Y','Z']

In [81]:
df1.join(df2)

    A   B   C   D    W    X    Y    Z
0  A0  B0  C0  D0  NaN  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN  NaN
2  A2  B2  C2  D2  NaN  NaN  NaN  NaN
3  A3  B3  C3  D3  NaN  NaN  NaN  NaN

In [82]:
df1.join(df2, how="outer")

     A    B    C    D    W    X    Y    Z
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

## DataFrame Operations

In [83]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [84]:
df['col2'].unique(), df['col2'].nunique()

(array([444, 555, 666], dtype=int64), 3)

In [85]:
 df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [86]:
type( df['col2'].value_counts())

pandas.core.series.Series

In [87]:
def times2(x):
    return 2*x

In [88]:
df['col2'].apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [89]:
df['col2'].apply(lambda x: x**2)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [90]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [92]:
df_new = df[['col1', 'col2']].copy()
df_new

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

In [100]:
df_new*2

   col1  col2
0     2   888
1     4  1110
2     6  1332
3     8   888

In [101]:
df_new.apply(lambda x: x*2)             # Cleaner syntax

   col1  col2
0     2   888
1     4  1110
2     6  1332
3     8   888

In [102]:
df.sort_values(by='col2').reset_index().drop(columns='index')

   col1  col2 col3
0     1   444  abc
1     4   444  xyz
2     2   555  def
3     3   666  ghi

In [103]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [104]:
df_pv = df.pivot_table(values='D',index=['A', 'B'],columns=['C'])
df_pv

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [105]:
df_pv.fillna(np.mean(df_pv))

C               x    y
A   B
bar one  4.000000  1.0
    two  2.333333  5.0
foo one  1.000000  3.0
    two  2.000000  3.0

## Read & Write Data

In [106]:
path = 'C:\\Users\\uditg\\Documents\\GitHub\\Udemy-Python-for-DS\\03-Python-for-Data-Analysis-Pandas\\'

In [107]:
pd.read_csv(path+'example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [108]:
pd.read_excel(path+'excel_sample.xlsx',index_col=0)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [109]:
webpage = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [110]:
webpage[0]       # reading tables from HTML

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [111]:
# pip install mysql-connector-python

import mysql.connector
import getpass

In [112]:
user_pwd = getpass.getpass('Enter you password: ')

cnx = mysql.connector.connect(user='root', password=user_pwd,
                              host='127.0.0.1',
                              database='employees')

Enter you password:

In [113]:
type(cnx)

mysql.connector.connection.MySQLConnection

In [114]:
sql_data = pd.read_sql_query('''
select * 
from employees.employees
where first_name like 'G%'
limit 50;
''', cnx)

In [115]:
sql_data.head()

   emp_no  birth_date first_name  last_name gender   hire_date
0   10001  1953-09-02     Georgi    Facello      M  1986-06-26
1   10015  1959-08-19   Guoxiang  Nooteboom      M  1987-07-02
2   10055  1956-06-06     Georgy     Dredge      M  1992-04-27
3   10063  1952-08-06       Gino  Leonhardt      F  1989-04-08
4   10075  1960-03-09        Gao   Dolinsky      F  1987-03-19

In [116]:
cnx.close()